cf/Documents/УстановкаЛимитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>УстановкаЛимитов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Лимиты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инициатор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущийЛимит</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/Лимиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Лимиты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.МВЗ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Documents/УстановкаЛимитов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЛимитыДлямВ
	 ПоказатьТекущийЛимит();
	 
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекущийЛимит()
	Для Каждого Стр Из Объект.Лимиты Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛимитыОбороты.СуммаОборот КАК ТекущийЛимит
		               |ИЗ
		               |	РегистрНакопления.Лимиты.Обороты КАК ЛимитыОбороты
		               |ГДЕ
		               |	ЛимитыОбороты.Инициатор = &Инициатор";
		Запрос.УстановитьПараметр("Инициатор", Стр.Инициатор);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр.ТекущийЛимит = Выборка.ТекущийЛимит;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ЛимитыДляИнициаторовПриИзменении(Элемент)
	// Вставить содержимое обработчика
	ПоказатьТекущийЛимит();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыИнициаторПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПоказатьТекущийЛимит();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВнешниеДанные(ИмяКоманды)
	
	ОткрытьФорму("Документ.УстановкаЛимитов.Форма.ЗагрузкаДанных", Новый Структура("Страница, СтруктураКолонокТовары, ИмяТаблицы, ЗагружатьКоличество", ИмяКоманды, Неопределено, "Объект.Лимиты", Истина),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеТабличногоДокумента(Команда)
	ЗагрузитьВнешниеДанные(Команда.Имя);
КонецПроцедуры
